backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def current_user
        token = request.headers['Auth-Key']
        begin
            user_id = JWT.decode(token,ENV['CRYPT_KEY'])[0]['user_id']
            @user = User.find_by(id: user_id)