backend/app/controllers/movies_controller.rb

    def index
        if current_user
            @movies = Movie.all
---
SELECT "movies".* FROM "movies"

    def find_movie
        @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]